In [1]:
#Ans1:apply
#date
#sum
#mean
#median
#mode

In [3]:
import pandas as pd
data={"a":[1,2,3,4],
       "b":[4,5,6,7],
      "c":["vikalp","jatin","lakhan","arslan"]}
df1=pd.DataFrame(data,index=['a','b','c','d'])

In [4]:
df1

   a  b       c
a  1  4  vikalp
b  2  5   jatin
c  3  6  lakhan
d  4  7  arslan

In [5]:
df1['a'].sum()

10

In [6]:
df1['a'].mean()

2.5

In [7]:
df1['a'].mode()

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [8]:
df1['a'].median()

2.5

In [9]:
date=pd.date_range(start="2023-04-23",end="2023-06-23")

In [10]:
date

DatetimeIndex(['2023-04-23', '2023-04-24', '2023-04-25', '2023-04-26',
               '2023-04-27', '2023-04-28', '2023-04-29', '2023-04-30',
               '2023-05-01', '2023-05-02', '2023-05-03', '2023-05-04',
               '2023-05-05', '2023-05-06', '2023-05-07', '2023-05-08',
               '2023-05-09', '2023-05-10', '2023-05-11', '2023-05-12',
               '2023-05-13', '2023-05-14', '2023-05-15', '2023-05-16',
               '2023-05-17', '2023-05-18', '2023-05-19', '2023-05-20',
               '2023-05-21', '2023-05-22', '2023-05-23', '2023-05-24',
               '2023-05-25', '2023-05-26', '2023-05-27', '2023-05-28',
               '2023-05-29', '2023-05-30', '2023-05-31', '2023-06-01',
               '2023-06-02', '2023-06-03', '2023-06-04', '2023-06-05',
               '2023-06-06', '2023-06-07', '2023-06-08', '2023-06-09',
               '2023-06-10', '2023-06-11', '2023-06-12', '2023-06-13',
               '2023-06-14', '2023-06-15', '2023-06-16', '2023-06-17',
               '2023-06-18', '2023-06-19', '2023-06-20', '2023-06-21',
               '2023-06-22', '2023-06-23'],
              dtype='datetime64[ns]', freq='D')

In [16]:
#Ans2:
data={'A':[1,2,3,4,5],
     'B':[4,5,6,7,8],
     'C':[6,7,8,9,10]}
labels=['1','2','3','4','5']

In [19]:
df=pd.DataFrame(data,index=labels)

In [20]:
df

   A  B   C
1  1  4   6
2  2  5   7
3  3  6   8
4  4  7   9
5  5  8  10

In [28]:
df.reindex(['1','3','5','7','9'])

    A   B   C
1 NaN NaN NaN
3 NaN NaN NaN
5 NaN NaN NaN
7 NaN NaN NaN
9 NaN NaN NaN

In [113]:
#Ans3:
data={'Values':[10,20,30,40,50]}
labels=['1','2','3','4','5']

In [114]:
df1=pd.DataFrame(data,index=labels)

In [115]:
df1

   Values
1      10
2      20
3      30
4      40
5      50

In [64]:
h=df1.iloc[:3]

In [65]:
h

    0
1  10
2  20
3  30

In [70]:
sum=0
for i in h[0]:
    sum+=i
print(sum)

60

In [73]:
#Ans4:
pd.set_option("display.max_colwidth",1000)
df4=pd.DataFrame({"Text":["Fiction-writing also has modes: action, exposition, description, dialogue, summary, and transition.[4] Author Peter Selgin refers to methods, including action, dialogue, thoughts, summary, scenes, and description.[5] Currently, there is no consensus within the writing community regarding the number and composition of fiction-writing modes and their uses","my name is vikal ","my colllage is very good"]})

In [74]:
df4

                                                                                                                                                                                                                                                                                                                                                                  Text
0  Fiction-writing also has modes: action, exposition, description, dialogue, summary, and transition.[4] Author Peter Selgin refers to methods, including action, dialogue, thoughts, summary, scenes, and description.[5] Currently, there is no consensus within the writing community regarding the number and composition of fiction-writing modes and their uses
1                                                                                                                                                                                                                                                                                                                                                    my name is vikal
2                                                                                                                                                                                                                                                                                                                                             my colllage is very good

In [75]:
df4['Word_Count']=df4['Text'].apply(lambda x:len(x.split()))

In [76]:
df4

,Text,Word_Count
0,"Fiction-writing also has modes: action, exposition, description, dialogue, summary, and transition.[4] Author Peter Selgin refers to methods, including action, dialogue, thoughts, summary, scenes, and description.[5] Currently, there is no consensus within the writing community regarding the number and composition of fiction-writing modes and their uses",45
1,my name is vikal,4
2,my colllage is very good,5

In [83]:
#Ans5:
df1.size

5

In [84]:
df1.shape

(5, 1)

In [86]:
#Ans6:
#read_excel

In [87]:
#Ans7:
data={"Email":['vikalp@gmail.com','jatin@gmail.com','love@gmail.com']}
df8=pd.DataFrame(data,index=[1,2,3])

In [88]:
df8

              Email
1  vikalp@gmail.com
2   jatin@gmail.com
3    love@gmail.com

In [92]:
df8['Username']=df8['Email'].apply(lambda x:x.split('@')[0])

In [93]:
df8

              Email Username
1  vikalp@gmail.com   vikalp
2   jatin@gmail.com    jatin
3    love@gmail.com     love

In [94]:
#Ans8:
data={'A':[3,8,6,2,9],
     'B':[5,2,9,3,1],
     'C':[1,7,4,5,2]}

In [95]:
df5=pd.DataFrame(data,index=[0,1,2,3,4])

In [96]:
df5

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [103]:
df5[(df5['A']>6) & (df5['B']<10)]

   A  B  C
1  8  2  7
4  9  1  2

In [116]:
#Ans9:
df1

   Values
1      10
2      20
3      30
4      40
5      50

In [118]:
df1['Values'].mean()

30.0

In [119]:
df1['Values'].median()

30.0

In [120]:
df1['Values'].std()

15.811388300841896

In [123]:
#Ans10:

data={'Sales':[1,2,3,4,5,6,7],
     'Date':['1feb','2feb','3feb','4feb','5feb','6feb','7feb']}
df=pd.DataFrame(data,index=[1,2,3,4,5,6,7])
def add_moving_average(df):
    ma = df['Sales'].rolling(window=7, min_periods=1).mean()
    df['MovingAverage'] = ma
    return df

In [124]:
df = add_moving_average(df)

In [125]:
df

   Sales  Date  MovingAverage
1      1  1feb            1.0
2      2  2feb            1.5
3      3  3feb            2.0
4      4  4feb            2.5
5      5  5feb            3.0
6      6  6feb            3.5
7      7  7feb            4.0

In [133]:
#Ans11:
date={'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']}

In [134]:
df=pd.DataFrame(date,index=[0,1,2,3,4])

In [135]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [136]:
date={'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05'],
     'Weekday':['Sunday','Monday','Tuesday','Wednesday','Thursday']}

In [137]:
df=pd.DataFrame(date,index=[0,1,2,3,4])

In [138]:
df

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

In [140]:
#Ans12:
date=pd.date_range(start="2023-01-01",end="2023-01-31")

In [141]:
date

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
#Ans13:
#pandas